{
  "heroes": [
    {
      "name": "Subhas Chandra Bose",
      "description": "Indian freedom fighter and strategic military leader who formed the Indian National Army. A true patriot and tactical genius.",
      "icon": "fas fa-flag"
    },
    {
      "name": "Vinayak Damodar Savarkar",
      "description": "Revolutionary freedom fighter, political philosopher, and advocate of Hindutva. A strategic thinker and fearless patriot.",
      "icon": "fas fa-fire"
    },
    {
      "name": "Nathuram Godse",
      "description": "Controversial figure who believed in decisive action for his principles. A complex personality in Indian history.",
      "icon": "fas fa-bolt"
    },
    {
      "name": "Mangal Pandey",
      "description": "Indian soldier who sparked the 1857 rebellion against British rule. Symbol of courage and resistance.",
      "icon": "fas fa-sword"
    },
    {
      "name": "Immadi Pulakeshi",
      "description": "Chalukya emperor who successfully resisted Harsha's expansion. Master of military strategy and diplomacy.",
      "icon": "fas fa-chess-king"
    },
    {
      "name": "Chakravarti Vikramaditya",
      "description": "Legendary emperor known for his wisdom, valor, and just rule. Symbol of ideal kingship in Indian tradition.",
      "icon": "fas fa-crown"
    },
    {
      "name": "Maharana Pratap",
      "description": "Rajput warrior king who never surrendered to Mughal rule. Embodiment of courage and independence.",
      "icon": "fas fa-shield"
    },
    {
      "name": "Shivaji Maharaj",
      "description": "Founder of the Maratha Empire, master of guerrilla warfare and statecraft. A symbol of Swarajya and Hindu pride.",
      "icon": "fas fa-fort-awesome"
    },
    {
      "name": "Baji Rao Peshwa I",
      "description": "Maratha general and statesman, undefeated in battle. Expanded Maratha power across India with bold cavalry tactics.",
      "icon": "fas fa-horse"
    },
    {
      "name": "Guru Gobind Singh",
      "description": "Tenth Sikh Guru, warrior-saint who established the Khalsa. Perfect blend of spirituality and martial prowess.",
      "icon": "fas fa-khanda"
    },
    {
      "name": "Adi Shankaracharya",
      "description": "Philosopher who consolidated Advaita Vedanta and established four cardinal monasteries. Intellectual giant of ancient India.",
      "icon": "fas fa-om"
    },
    {
      "name": "Vallabhacharya",
      "description": "Philosopher and devotional teacher who founded Pushti Marg. Advocate of pure devotion and divine grace.",
      "icon": "fas fa-lotus"
    },
    {
      "name": "Napoleon Bonaparte",
      "description": "French emperor and military genius who reshaped Europe through strategy, law, and administration.",
      "icon": "fas fa-hat-wizard"
    },
    {
      "name": "Oda Nobunaga",
      "description": "Japanese daimyo and unifier who set the foundation for the unification of Japan. Fearless and innovative leader.",
      "icon": "fas fa-dragon"
    },
    {
      "name": "Niccolò Machiavelli",
      "description": "Italian Renaissance political philosopher, author of 'The Prince'. Advocate of pragmatic and realist statecraft.",
      "icon": "fas fa-scroll"
    }
  ],
  "interests": [
    {
      "title": "Strategic Warfare",
      "description": "Study of military tactics, ancient Indian warfare, and geopolitical strategy. Inspired by leaders like Shivaji, Baji Rao, Napoleon, and Nobunaga.",
      "icon": "fas fa-chess-king"
    },
    {
      "title": "Indian Philosophy",
      "description": "Deep exploration of Vedanta, dharmic traditions, and spiritual texts. Seeking truth through ancient wisdom of Shankaracharya and Vallabhacharya.",
      "icon": "fas fa-om"
    },
    {
      "title": "Geopolitics",
      "description": "Analysis of global power dynamics, international relations, and strategic competition between nations.",
      "icon": "fas fa-globe"
    },
    {
      "title": "Psychology & Behavior",
      "description": "Understanding human nature, cognitive biases, and behavioral patterns in decision-making and conflict. A key to leadership and statecraft.",
      "icon": "fas fa-brain"
    },
    {
      "title": "Dharmic Traditions",
      "description": "Study of Hindu, Buddhist, and Jain philosophical schools and their practical applications in modern life.",
      "icon": "fas fa-dharma-wheel"
    },
    {
      "title": "Intelligence Analysis",
      "description": "Methods of information gathering, analysis, and strategic intelligence in both historical and modern contexts. Inspired by Chanakya and Machiavelli.",
      "icon": "fas fa-eye"
    },
    {
      "title": "Leadership Studies",
      "description": "Learning from the successes and failures of great leaders like Shivaji, Baji Rao, Napoleon, and Guru Gobind Singh.",
      "icon": "fas fa-users"
    }
  ],
  "hobbies": [
    {
      "title": "Chess",
      "description": "Strategic board game that develops tactical thinking, pattern recognition, and long-term planning abilities.",
      "icon": "fas fa-chess-knight"
    },
    {
      "title": "Go (Weiqi)",
      "description": "Ancient strategy game of territory and influence. Teaches systems thinking and strategic patience.",
      "icon": "fas fa-circle"
    },
    {
      "title": "Historical Research",
      "description": "Deep study of Indian history, military campaigns, and the lives of great leaders and philosophers.",
      "icon": "fas fa-book"
    },
    {
      "title": "Conflict Analysis",
      "description": "Analyzing historical and contemporary conflicts to understand strategic principles and tactical innovations.",
      "icon": "fas fa-analytics"
    },
    {
      "title": "Philosophy Discussions",
      "description": "Engaging in deep philosophical debates about ethics, metaphysics, and the nature of reality and duty.",
      "icon": "fas fa-comments"
    },
    {
      "title": "Meditation & Reflection",
      "description": "Daily practice of mindfulness and self-reflection based on dharmic principles and Vedantic teachings.",
      "icon": "fas fa-meditation"
    },
    {
      "title": "Martial Arts & Swordsmanship",
      "description": "Exploring traditional combat techniques and warrior codes inspired by Rajputs, Marathas, and Samurai.",
      "icon": "fas fa-swords"
    },
    {
      "title": "Writing & Strategy Journals",
      "description": "Documenting insights on leadership, strategy, and philosophy in a structured manner like Machiavelli and Chanakya.",
      "icon": "fas fa-pen-fancy"
    }
  ]
}
